tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/panelRegion/char
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      char;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{

    ".*"
    {
        type            zeroGradient;
    }

    fRight_zone_side
    {
        type            wedge;
    }

    fLeft_zone_side
    {
        type            wedge;
    }

    "(region0_to.*)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
