tutorials/combustion/fireFoam/LES/oppositeBurningPanels/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=`getApplication`

runApplication blockMesh

runApplication -s cRefine \
    topoSet -dict system/cRefine.topoSetDict

runApplication refineMesh -overwrite -dict system/refineMeshDict

runApplication -s f \
    topoSet -dict system/f.topoSetDict

# create the pyrolysis region.
runApplication extrudeToRegionMesh -overwrite


runApplication -s fBurner \
    topoSet -dict system/fBurner.topoSetDict

runApplication createPatch -overwrite

cp 0/ph_rgh.orig 0/ph_rgh

runApplication -s master \
    decomposePar -force

runApplication -s panelRegion \
    decomposePar -region panelRegion

runApplication -s fields \
    decomposePar -fields

runParallel `getApplication`

paraFoam -touch
paraFoam -touch -region panelRegion


#------------------------------------------------------------------------------
